{
  "component": {
    "loader": {
      "text-loading": "Loading..."
    },
    "sidebar": {
      "text-menu-about": "About",
      "text-menu-experience": "Experience",
      "text-menu-portfolio": "Portfolio",
      "text-menu-skills": "Skills",
      "text-menu-education": "Education",
      "text-menu-contact": "Contact"
    },
    "topbar": {
      "text-menu-about": "About",
      "text-menu-experience": "Experience",
      "text-menu-portfolio": "Portfolio",
      "text-menu-skills": "Skills",
      "text-menu-education": "Education",
      "text-menu-contact": "Contact"
    },
    "alert-dialog": {
      "text-btn-close": "Close"
    },
    "portfolio-dialog": {
      "project1": {
        "text-project1-title": "KMA Marketplace",
        "text-project1-subject": "The KMA Marketplace is one of the products offered by Krungsri Bank, providing services for online shopping through various merchants collaborating with the bank on the KMA app. The operation is in the form of a web application displayed on the web view of the KMA app. I have been involved in designing the project structure and initiating development in the first phase using the React.js library. The system is developed for four merchants, namely Major Cineplex for movie ticket reservations, HIS for tour package reservations, McDonald's for food ordering, and The Pizza Company.",
        "text-project1-client": "Krungsri Bank",
        "text-project1-date": "September 2019",
        "text-project1-service": "Web Application (React.js)"
      },
      "project2": {
        "text-project2-title": "Krungsri Auto SmartQ",
        "text-project2-subject": "Krungsri Auto SmartQ is a queue management system developed by Krungsri Bank to facilitate the convenience of bank employees and enhance the speed of providing car loan services to customers at each branch. The system integrates various components, including Kiosk machines, a website, and services. I have been assigned the responsibility for the web application part called Softkeypad, which allows employees to call, pause, cancel queues, display customer information, and make advance queue reservations. This enables employees to use the system on browsers at the branch's computer. I have been involved in designing the project structure and development, which was completed using the React.js library.",
        "text-project2-client": "Krungsri Bank",
        "text-project2-date": "January 2021, November 2023",
        "text-project2-service": "Web Application (React.js), Service (Asp.net C#)"
      },
      "project3": {
        "text-project3-title": "Ekyc App",
        "text-project3-subject": "The Ekyc App is an electronic identity verification and validation system developed by CODE-D 789 Company. It is designed to confirm and validate customer information and identity electronically. The service aims to address challenges faced by partners, particularly in the banking sector. The identity verification process involves checking information on the national identification card, confirming through OTP, and utilizing Face Recognition technology. The system operates through various components, including a website and services. I have been assigned the responsibility for the web application part and have been involved in designing the project structure and development. The development process was completed using the React.js library.",
        "text-project3-client": "CODE-D 789",
        "text-project3-date": "October 2021",
        "text-project3-service": "Web Application (React.js)"
      },
      "project4": {
        "text-project4-title": "Seanheng Chatbot",
        "text-project4-subject": "The Seanheng Chatbot is a business management system developed by CODE-D 789 Company for online merchants. It is designed to be a product that facilitates convenience and addresses customer care challenges for online business owners. This backend system assists in product management, order management, and includes a Livechat system with a Chatbot to enhance convenience. It also handles document generation for receipts, shipping labels, and other documents in PDF format. I have been assigned the responsibility for the web application part and have been involved in designing the project structure. Additionally, I played a role in developing the core system of the mentioned web application. The development process was completed using the React.js library.",
        "text-project4-client": "CODE-D 789",
        "text-project4-date": "April 2021",
        "text-project4-service": "Web Application (React.js)"
      },
      "project5": {
        "text-project5-title": "Thai Smart Card Reader Library",
        "text-project5-subject": "The Thai Smart Card Reader Library is a module developed for communicating with Thai national ID smart cards through a card reader. It utilizes the sending of Application Protocol Data Unit (APDU) commands to establish communication with the Chip/Smart Card Interface Devices (CCID) on the card, prompting it to return data. I was tasked with researching information and developing a class library to handle the functions of sending and receiving data in the form of a library, allowing other projects to access it. The library is written in Java.",
        "text-project5-client": "CODE-D 789",
        "text-project5-date": "November 2018",
        "text-project5-service": "Class Library (Java)"
      },
      "project6": {
        "text-project6-title": "SCB Smart Teller",
        "text-project6-subject": "SCB Smart Teller is a large-scale financial transaction system of Siam Commercial Bank (SCB), developed to enhance convenience for bank employees and elevate the speed of customer service. I have been a part of this project in the team called STEL Existing, responsible for supporting and troubleshooting various issues faced by the company's development team during the development of this project. My role includes participating in system development according to the bank's requirements, such as developing the central system Transfer module using WPF (Windows Presentation Foundation) to allow other components to call its functions. I have also been involved in the development of services related to the Deposit, Withdrawal, and Transfer subsystems.",
        "text-project6-client": "Siam Commercial Bank",
        "text-project6-date": "June 2022",
        "text-project6-service": "Team Support, WPF, Service (Java Springboot)"
      },
      "project7": {
        "text-project7-title": "Kbol Backend FX Special Rate (SWIFT)",
        "text-project7-subject": "The Kbol Backend FX Special Rate (SWIFT) is a backend system designed for managing transactions at Krungthai Bank. It is created to facilitate the convenience of the bank's team in providing services to business customers. In this project, my responsibility has been to develop the system based on the requirements provided by the bank, particularly in the Web Backend module using the Asp.net language. This module specifically deals with currency values and exchange rates between countries, encompassing the management of buy and sell orders, table display, and report generation for summary purposes.",
        "text-project7-client": "Krungsri Bank",
        "text-project7-date": "April 2020",
        "text-project7-service": "Web Backend (Asp.net C#)"
      },
      "project8": {
        "text-project8-title": "Giving Forward Api Adapter Library",
        "text-project8-subject": "The Giving Forward Api Adapter Library is a module developed for interfacing with the Core Banking system of CODE-D 789 Company. It is utilized within the Giving Forward E-Commerce App. In this project, I have been tasked with developing the class to provide functions for sending and receiving data, structured as a library for other projects to utilize. The library is written in the C# programming language.",
        "text-project8-client": "CODE-D 789",
        "text-project8-date": "February 2019",
        "text-project8-service": "Class Library (Asp.net C#)"
      },
      "project9": {
        "text-project9-title": "Skill Development Workshop",
        "text-project9-subject": "The Skill Development Workshop is a training program developed by CODE-D 789 Company to enhance the skills of its personnel. The workshop aims to promote learning and application of acquired skills in various projects. In this context, I have been responsible for designing and developing the curriculum for teaching fundamental web application development using React.js and basic desktop application development using WPF (Windows Presentation Foundation). The training is delivered through both workshop sessions and online teaching methods.",
        "text-project9-client": "CODE-D 789",
        "text-project9-date": "July 2020, March 2022",
        "text-project9-service": "React.js Workshop, WPF Workshop"
      },
      "text-btn-close": "Close"
    }
  },
  "page": {
    "about-section": {
      "text-first-name": "Thiwat",
      "text-last-name": "Piyasupkij",
      "text-quotation": "Learning, Doing,",
      "text-quotation2": "Create New Possibilities",
      "text-subject": "I am a Software Engineer with over 4 years of experience, collaborating with leading banking partners in Thailand. With the skills and abilities I possess, I am confident in contributing to achieving the goals and success of the team."
    },
    "experience-section": {
      "text-title": "Experience",
      "text-topic": "Software Engineer",
      "text-work-period": "October 2018 - Present",
      "text-subject-paragraf1": "Hatari NEXT and CODE-D 789 are the companies where I began my career as a programmer. They specialize in digital business at the organizational level, with over 10 years of expertise. I have had the privilege of working with them on various projects, including the development of organizational software, mobile applications, and websites. These projects are intricately integrated with the core-banking system of a globally renowned Thai financial institution.",
      "text-subject-paragraf2": "Some notable projects I have contributed to include the Marketplace website for KMA App of KrungSri Ayudhya Bank, WPF STEL for counter staff of Siam Commercial Bank, and the Seanheng website for managing the online business of a company's vendors.",
      "text-subject-paragraf3": "Over the course of my 4 year collaboration with them, I have had the opportunity to develop both hard and soft skills. This experience has opened doors for skill enhancement and has allowed me to showcase my abilities through successful project developments. I genuinely appreciate everyone in the company, as I believe reaching this point would not have been possible without the teamwork and collective efforts.",
      "text-subject-paragraf4": "Looking for a new job this time, I see this as an opportunity for mutual acquaintance and learning. I am confident that my skills and experiences can contribute to solving problems and propel the organization toward its goals. I hope for the chance to work together. Thank you",
      "text-subject-paragraf5": "Thiwat Piyasupkij"
    },
    "portfolio-section": {
      "text-title": "Portfolio",
      "text-btn-all": "All",
      "text-btn-web-apps": "Web Apps",
      "text-btn-web-backend": "Web Backend",
      "text-btn-window-apps": "Window Apps",
      "text-btn-class-library": "Class Library",
      "text-btn-workshop": "Workshop",
      "text-project1": "KMA Marketplace",
      "text-project2": "Krungsri Auto SmartQ",
      "text-project3": "Ekyc App",
      "text-project4": "Seanheng Chatbot",
      "text-project5": "Thai Smart Card Reader Library",
      "text-project6": "SCB Smart Teller",
      "text-project7": "Kbol Backend FX Special Rate (SWIFT)",
      "text-project8": "Giving Forward Api Adapter Library",
      "text-project9": "Skill Development Workshop"
    },
    "skills-section": {
      "text-title": "Skills",
      "text-skill-title1": "React JS",
      "text-skill-title2": "Bootstrap",
      "text-skill-title3": "jQuery",
      "text-skill-title4": "ASP.NET",
      "text-skill-title5": "WPF",
      "text-skill-title6": "Xamarin",
      "text-skill-title7": "Flutter",
      "text-skill-title8": "Java Spring Boot",
      "text-skill-title9": "SQL Server",
      "text-skill-title10": "MySQL",
      "text-skill-title11": "Kibana",
      "text-skill-title12": "Jenkins",
      "text-skill-title13": "Microsoft Office",
      "text-skill-title14": "WordPress",
      "text-skill-title15": "Photoshop",
      "text-skill-title16": "Vegas Pro",
      "text-skill-desc1": "Web App development skills with Javascript library (HTML, Javascript, CSS)",
      "text-skill-desc2": "Responsive Web development skills with CSS Framework",
      "text-skill-desc3": "Apply Dom and Event management for Web App development",
      "text-skill-desc4": "Web Server (Microservice, API) and Web Backend development skills with .NET Framework C# language",
      "text-skill-desc5": "App development skills on Windows operating system with .NET Framework C# language",
      "text-skill-desc6": "Native App development skills on iOS, Android, and Windows operating systems with the .NET Framework C# language",
      "text-skill-desc7": "Native App development skills on iOS, Android, Website operating systems using Dart language",
      "text-skill-desc8": "Web Server development skills (Microservice, API) with Spring Framework Java language",
      "text-skill-desc9": "Database management skills with Microsoft SQL Server (CRUD, Stored Procedures)",
      "text-skill-desc10": "Database management skills with Microsoft SQL Server (CRUD)",
      "text-skill-desc11": "Usage skills Elasticsearch Kibana for searching and analyzing data",
      "text-skill-desc12": "Automation server CI/CD usage skills for Build and Deploy",
      "text-skill-desc13": "Skills in using office programs Word, Excel, and PowerPoint",
      "text-skill-desc14": "Skills in using CMS systems for managing content on websites",
      "text-skill-desc15": "Basic skills in using Adobe Photoshop to decorate, edit images",
      "text-skill-desc16": "Basic skills in using Vegas Pro for video editing"
    },
    "education-section": {
      "text-title": "Education",
      "text-date-swu": "June 2010 - March 2014",
      "text-title-swu": "Srinakharinwirot University, Thailand",
      "text-description-swu": "Bachelor of Science (GPAX 3.32)",
      "text-date-dpu": "June 2018 - August 2018",
      "text-title-dpu": "Dhurakij Pundit University, Thailand",
      "text-description-dpu": "Programmer Bootcamp #1 with Hatari Wireless Company & CITE@DPU"
    },
    "contact-section": {
      "text-title": "Contact",
      "text-sentence": "I am delighted with every opportunity presented to me. If you want to contact me You can inform us. Thank you.",
      "text-name": "Full Name",
      "input-name-error": "Thai characters and English characters only",
      "input-name-error2": "Please fill in full name completely.",
      "text-email": "Email",
      "input-email-error": "Invalid email format",
      "input-email-error2": "Please fill in email completely.",
      "text-subject": "Subject",
      "input-subject-error": "Please fill in subject completely.",
      "text-message": "Message",
      "input-message-error": "Please fill in message completely.",
      "text-sql-injection-error": "Script has been used. Unable to continue.",
      "text-send-data-success": "Send data successfully",
      "text-send-data-fail": "Failed to send data because: ",
      "text-phone": "Phone",
      "text-btn-send": "SEND"
    }
  }
}