{
  "component": {
    "loader": {
      "text-loading": "กำลังโหลด..."
    },
    "sidebar": {
      "text-menu-about": "About",
      "text-menu-experience": "Experience",
      "text-menu-portfolio": "Portfolio",
      "text-menu-skills": "Skills",
      "text-menu-education": "Education",
      "text-menu-contact": "Contact"
    },
    "topbar": {
      "text-menu-about": "About",
      "text-menu-experience": "Experience",
      "text-menu-portfolio": "Portfolio",
      "text-menu-skills": "Skills",
      "text-menu-education": "Education",
      "text-menu-contact": "Contact"
    },
    "alert-dialog": {
      "text-btn-close": "Close"
    },
    "portfolio-dialog": {
      "project1": {
        "text-project1-title": "KMA Marketplace",
        "text-project1-subject": "KMA Marketplace เป็นหนึ่งในผลิตภัณฑ์ของทางธนาคารกรุงศรีที่ให้บริการสำหรับช้อปปิ้งผ่านร้านค้าออนไลน์ต่างๆ ที่ร่วมบริการกับทางธนาคารบน App KMA ซึ่งการทำงานจะเป็นในรูปแบบ Web Appliaction แสดงผลบน Web View ของ App โดยทางผมได้เป็นผู้ออกแบบโครงสร้าง Project และการพัฒนาเริ่มต้นในเฟสแรกด้วย React.js Library ซึ่งพัฒนาระบบให้กับร้านค้า 4 แห่ง คือ บริการจองตั๋วหนังของ Major Cineplex, บริการจองแพ็คเกจทัวร์ HIS, บริการสั่งอาหารของร้าน McDonald's และ The Pizza Company",
        "text-project1-client": "Krungsri Bank",
        "text-project1-date": "September 2019",
        "text-project1-service": "Web Application (React.js)"
      },
      "project2": {
        "text-project2-title": "Krungsri Auto SmartQ",
        "text-project2-subject": "Krungsri Auto SmartQ เป็นระบบจัดการคิวของทางธนาคารกรุงศรี ซึ่งสร้างขึ้นไว้เพื่ออำนวยความสะดวกให้ทางพนักงานของทางธนาคารได้ใช้งานและยกระดับความรวดเร็วในการให้บริการสินเชื่อรถยนต์แก่ลูกค้าที่เข้ามาใช้บริการในแต่ละสาขาของทางธนาคารเอง ตัวระบบมีการทำงานร่วมกันหลายส่วนไม่ว่าจะเป็นเครื่อง Kiosk, Website หรือ Service ซึ่งทางผมได้รับหน้าที่รับผิดชอบส่วน Web Appliaction จัดการคิวที่ชื่อ Softkeypad ซึ่งสามารถเรียก หยุด ยกเลิกคิว, แสดงผลข้อมูลลูกค้า, ทำการจองคิวล่วงหน้าได้ เพื่อให้พนักงานใช้งานบน Browser ที่เครื่องคอมพิวเตอร์สาขา โดยทางผมได้เป็นผู้ออกแบบโครงสร้าง Project และการพัฒนาจนแล้วเสร็จด้วย React.js Library",
        "text-project2-client": "Krungsri Bank",
        "text-project2-date": "January 2021, November 2023",
        "text-project2-service": "Web Application (React.js), Service (Asp.net C#)"
      },
      "project3": {
        "text-project3-title": "Ekyc App",
        "text-project3-subject": "Ekyc App เป็นระบบยืนยันและตรวจสอบความถูกต้องของข้อมูลและตัวตนของลูกค้าในรูปแบบอิเล็กทรอนิกส์ซึ่งเป็นบริการที่ทางบริษัท CODE-D 789 พัฒนาขึ้น เพื่อหวังให้เป็นผลิตภัณฑ์ที่ช่วยแก้ปัญหาให้กับทางคู่ค้าอย่างธนาคาร โดยมีรูปแบบการยืนยันตัวตนด้วยการตรวจสอบข้อมูลบนหน้าบัตรปชช, การยืนยันด้วย OTP และการทำ Face Recognition ตัวระบบมีการทำงานร่วมกันหลายส่วนไม่ว่าจะเป็น Website หรือ Service ซึ่งทางผมได้รับหน้าที่รับผิดชอบส่วน Web Appliaction โดยได้เป็นผู้ออกแบบโครงสร้าง Project และการพัฒนาจนแล้วเสร็จด้วย React.js Library",
        "text-project3-client": "CODE-D 789",
        "text-project3-date": "October 2021",
        "text-project3-service": "Web Application (React.js)"
      },
      "project4": {
        "text-project4-title": "Seanheng Chatbot",
        "text-project4-subject": "Seanheng Chatbot เป็นระบบจัดการร้านค้าสำหรับผู้ค้าขายออนไลน์ซึ่งเป็นบริการที่ทางบริษัท CODE-D 789 พัฒนาขึ้น เพื่อหวังให้เป็นผลิตภัณฑ์ที่ช่วยอำนวยความสะดวกและแก้ปัญไขหาการดูแลลูกค้าให้กับทางพ่อค้า แม่ค้าออนไลน์ โดยเป็นระบบหลังบ้านที่ช่วยในการจัดการสินค้า, จัดการออเดอร์, ระบบ Livechat ที่มี Chatbot ช่วยอำนวนความสะดวก, การออกเอกสารใบเสร็จ ใบปะหน้าจัดส่ง เอกสารอื่นๆ ในรูปแบบ PDF เป็นต้น ทางผมได้รับหน้าที่รับผิดชอบส่วน Web Appliaction โดยได้เป็นผู้ออกแบบโครงสร้าง Project และมีส่วนในการพัฒนาระบบหลักๆ ของทางเว็บที่กล่าวมาข้างต้นจนแล้วเสร็จอีกด้วย React.js Library",
        "text-project4-client": "CODE-D 789",
        "text-project4-date": "April 2021",
        "text-project4-service": "Web Application (React.js)"
      },
      "project5": {
        "text-project5-title": "Thai Smart Card Reader Library",
        "text-project5-subject": "Thai Smart Card Reader Library เป็นโมดูลที่พัฒนาขึ้นสำหรับติดต่อสื่อสารกับบัตรประชาชนไทยแบบ Smart Card ผ่านเครื่องอ่านบัตร ด้วยการส่งคำสั่ง APDU (Application Protocol Data Unit) เข้าไปติดต่อกับ CCID (Chip/ Smart Card Interface Devices) ที่ตัวบัตรแล้วให้ส่งข้อมูลกลับมา ทางผมได้รับหน้าที่รับผิดชอบ research ข้อมูลและพัฒนาตัว class สำหรับบริการฟังค์ชั่นเรียกรับ-ส่งข้อมูลขึ้นมาในรูปแบบ Library ให้ Project อื่นๆ เรียกใช้ ด้วยภาษา Java",
        "text-project5-client": "CODE-D 789",
        "text-project5-date": "November 2018",
        "text-project5-service": "Class Library (Java)"
      },
      "project6": {
        "text-project6-title": "SCB Smart Teller",
        "text-project6-subject": "SCB Smart Teller เป็นระบบการทำธุรกรรมทางการเงินขนาดใหญ่ของธนาคารไทยพาณิชย์ ซึ่งสร้างขึ้นไว้เพื่ออำนวยความสะดวกให้ทางพนักงานของทางธนาคารได้ใช้งานและยกระดับความรวดเร็วในการให้บริการแก่ลูกค้าที่เข้ามาใช้บริการ ซึ่งทางผมก็ได้เป็นส่วนหนึ่งของ Project นี้ในส่วนทีมที่ชื่อว่า STEL Existing ซึ่งมีหน้าที่รับผิดชอบในการ support และช่วยแก้ไขปัญหาให้ทีม Dev ของบริษัทที่ติดปัญหาต่างๆ ในการพัฒนา Project นี้ รวมถึงมีส่วนร่วมในการพัฒนาระบบตาม Requirment ของทางธนาคารด้วย อาทิ การพัฒนาโมดูลกลางระบบ Transfer (WPF) สำหรับให้ส่วนอื่นๆ เรียกใช้งานหรือ การพัฒนา Service ที่เกี่ยวข้องกับระบบ Deposit, Withdraw และ Transfer เป็นต้น",
        "text-project6-client": "Siam Commercial Bank",
        "text-project6-date": "June 2022",
        "text-project6-service": "Team Support, WPF, Service (Java Springboot)"
      },
      "project7": {
        "text-project7-title": "Kbol Backend FX Special Rate (SWIFT)",
        "text-project7-subject": "Kbol Backend FX Special Rate (SWIFT) เป็นระบบหลังบ้านสำหรับจัดการธุรกรรมของทางธนาคารกรุงศรี ซึ่งสร้างขึ้นไว้เพื่ออำนวยความสะดวกให้ทางทีมงานธนาคารได้ใช้ในการให้บริการลูกค้าภาคธุรกิจ ซึ่งทางผมได้รับหน้าที่รับผิดชอบพัฒนาระบบตาม Requirment ของทางธนาคารฝั่ง Web Backend ด้วยภาษา Asp.net ในโมดูลค่าเงินและอัตราแลกเปลี่ยนระหว่างประเทศทั้งระบบจัดการคำสั่งซื้อขาย การแสดงผลตาราง และการออก Report สรุป",
        "text-project7-client": "Krungsri Bank",
        "text-project7-date": "April 2020",
        "text-project7-service": "Web Backend (Asp.net C#)"
      },
      "project8": {
        "text-project8-title": "Giving Forward Api Adapter Library",
        "text-project8-subject": "Giving Forward Api Adapter Library เป็นโมดูลที่พัฒนาขึ้นสำหรับติดต่อกับระบบ Core Bank ของทางบริษัท CODE-D 789 โดยมีการใช้งานใน  Giving Forward ซึ่งเป็น E-Commerce App ทางผมได้รับหน้าที่รับผิดชอบพัฒนาตัว class สำหรับให้บริการฟังค์ชั่นเรียกรับ-ส่งข้อมูลขึ้นมาในรูปแบบ Library ให้ Project อื่นๆ เรียกใช้ ด้วยภาษา C#",
        "text-project8-client": "CODE-D 789",
        "text-project8-date": "February 2019",
        "text-project8-service": "Class Library (Asp.net C#)"
      },
      "project9": {
        "text-project9-title": "Skill Development Workshop",
        "text-project9-subject": "Skill Development Workshop เป็นหลักสูตรพัฒนาทักษะบุคลากรที่ทางบริษัท CODE-D 789 จัดทำขึ้นเพื่อส่งเสริมให้พนักงานได้เรียนรู้และนำไปใช้ในการพัฒนา Project ต่างๆ ทางผมได้รับหน้าที่รับผิดชอบออกแบบและพัฒนาหลักสูตรการสอนในส่วนการพัฒนา Web Application เบื้องต้นด้วย React.js และการพัฒนา Desktop App ด้วย WPF เบื้องต้น ซึ่งมีทั้งจัดทำสอนในรูปแบบ Workshop และการสอนออนไลน์",
        "text-project9-client": "CODE-D 789",
        "text-project9-date": "July 2020, March 2022",
        "text-project9-service": "React.js Workshop, WPF Workshop"
      },
      "text-btn-close": "Close"
    }
  },
  "page": {
    "about-section": {
      "text-first-name": "ทิวัตถ์",
      "text-last-name": "ปิยศุภกิจ",
      "text-quotation": "เรียนรู้, ลงมือทำ,",
      "text-quotation2": "สร้างสรรค์ความเป็นไปได้ใหม่ๆ",
      "text-subject": "ผมเป็น Software Engineer ที่มีประสบการณ์มากกว่า 5 ปี ทำงานร่วมกับพาร์ทเนอร์ธนาคารชั้นนำในประเทศไทย ด้วยทักษะและความสามารถที่ผมมี ผมมั่นใจว่าจะช่วยให้บรรลุเป้าหมายและความสำเร็จของทีม"
    },
    "experience-section": {
      "text-title": "Experience",
      "text-topic": "Software Engineer",
      "text-work-period": "October 2018 - Present",
      "text-subject-paragraf1": "Hatari NEXT และ CODE-D 789 เป็นเครือบริษัทที่ผมเริ่มต้นทำงานในสายงานโปรแกรมเมอร์ พวกเขาเชี่ยวชาญด้านธุรกิจดิจิทัลระดับองค์กรมามากกว่า 10 ปี ผมได้มีส่วนร่วมในการทำงานกับพวกเขา ทั้งการพัฒนาซอฟต์แวร์องค์กร แอปพลิเคชันบนมือถือ และเว็บไซต์ ซึ่งมีการบูรณาการอย่างแนบแน่นเข้ากับระบบ core-bank ของสถาบันการเงินไทยที่มีชื่อเสียงระดับโลก",
      "text-subject-paragraf2": "ผลงานเด่นๆ ที่ผมได้มีส่วนร่วมพัฒนาด้วย อาทิเช่น Website Marketplace สำหรับ App KMA ของธนาคารกรุงศรีอยุธยา,  WPF STEL สำหรับพนักงานเคานฺเตอร์ของธนาคารไทยพาณิชย์, Website Seanheng สำหรับจัดการธุรกิจสำหรับผู้ขายของออนไลน์ซึ่งเป็นผลิตภัณฑ์ของบริษัท เป็นต้น",
      "text-subject-paragraf3": "จากประสบการณ์การทำงานถึง 5 ปี ที่ได้ทำงานร่วมกับพวกเขา ช่วยเปิดโอกาสในการพัฒนาทักษะและความสามารถด้านโปรแกรมเมอร์ทั้ง Hard Skill และ Soft Skill รวมถึงพิสูจน์ควา่มสามารถของผมผ่านผลงานที่พัฒนาขึ้นมาตลอดมาได้เป็นอย่างดี ซึ่งจะไม่มีวันมาถึงจุดนี้ได้หากขาดทีมและทุกๆ คนในบริษัท ผมรู้สึกขอบคุณพวกเขาจากใจจริง",
      "text-subject-paragraf4": "การมองหางานใหม่ในครั้งนี้จะเป็นโอกาสให้ผมและคุณได้รู้จักกัน เรียนรู้ซึ่งกันและกัน ผมมั่นใจว่าทักษะและประสบการณ์ของผมจะช่วยคุณแก้ไขปัญหาและพาองค์กรไปสู่เป้าหมายตามที่ตั้งใจไว้ได้ครับ หวังว่าจะได้ร่วมงานกันครับ ขอบคุณ",
      "text-subject-paragraf5": "ทิวัตถ์ ปิยศุภกิจ"
    },
    "portfolio-section": {
      "text-title": "Portfolio",
      "text-btn-all": "All",
      "text-btn-web-apps": "Web Apps",
      "text-btn-web-backend": "Web Backend",
      "text-btn-window-apps": "Window Apps",
      "text-btn-class-library": "Class Library",
      "text-btn-workshop": "Workshop",
      "text-project1": "KMA Marketplace",
      "text-project2": "Krungsri Auto SmartQ",
      "text-project3": "Ekyc App",
      "text-project4": "Seanheng Chatbot",
      "text-project5": "Thai Smart Card Reader Library",
      "text-project6": "SCB Smart Teller",
      "text-project7": "Kbol Backend FX Special Rate (SWIFT)",
      "text-project8": "Giving Forward Api Adapter Library",
      "text-project9": "Skill Development Workshop"
    },
    "skills-section": {
      "text-title": "Skills",
      "text-skill-title1": "React JS",
      "text-skill-title2": "Bootstrap",
      "text-skill-title3": "jQuery",
      "text-skill-title4": "ASP.NET",
      "text-skill-title5": "WPF",
      "text-skill-title6": "Xamarin",
      "text-skill-title7": "Flutter",
      "text-skill-title8": "Java Spring Boot",
      "text-skill-title9": "SQL Server",
      "text-skill-title10": "MySQL",
      "text-skill-title11": "Kibana",
      "text-skill-title12": "Jenkins",
      "text-skill-title13": "Microsoft Office",
      "text-skill-title14": "WordPress",
      "text-skill-title15": "Photoshop",
      "text-skill-title16": "Vegas Pro",
      "text-skill-desc1": "ทักษะการพัฒนา Web App ด้วย Javascript Library (HTML, Javascript, CSS)",
      "text-skill-desc2": "ทักษะการพัฒนา Web Responsive ด้วย CSS Framework",
      "text-skill-desc3": "ประยุกต์ใช้การจัดการ Dom และ Event สำหรับการพัฒนา Web App",
      "text-skill-desc4": "ทักษะการพัฒนา Web Server (Microservice, API) และ Web Backend ด้วย .NET Framework ภาษา C#",
      "text-skill-desc5": "ทักษะการพัฒนา App บนระบบปฏิบัติการ windows ด้วย .NET Framework ภาษา C#",
      "text-skill-desc6": "ทักษะการพัฒนา Native App บนระบบปฏิบัติการ iOS, Android, and Windows ด้วย .NET Framework ภาษา C#",
      "text-skill-desc7": "ทักษะการพัฒนา Native App บนระบบปฏิบัติการ iOS, Android, Website ด้วยภาษา Dart",
      "text-skill-desc8": "ทักษะการพัฒนา Web Server (Microservice, API) ด้วย Spring Framework ภาษา Java",
      "text-skill-desc9": "ทักษะการจัดการฐานข้อมูลด้วย Microsoft SQL Server (CRUD, Stored Procedures)",
      "text-skill-desc10": "ทักษะการจัดการฐานข้อมูลด้วย Microsoft SQL Server (CRUD)",
      "text-skill-desc11": "ทักษะการใช้งาน Elasticsearch Kibana สำหรับค้นหาและวิเคราะห์ข้อมูล",
      "text-skill-desc12": "ทักษะการใช้งาน Automation Server CI/CD สำหรับ Build และ Deploy",
      "text-skill-desc13": "ทักษะการใช้งานโปรแกรมสำนักงาน Word, Excel และ PowerPoint",
      "text-skill-desc14": "ทักษะการใช้งานระบบ CMS สำหรับการจัดการเนื้อหาบน Website",
      "text-skill-desc15": "ทักษะการใช้งานโปรแกรม Adobe Photoshop ตกแต่ง, ตัดต่อรูปภาพ เบื้องต้น",
      "text-skill-desc16": "ทักษะการใช้งานโปรแกรม Vegas Pro ตัดต่อวีดีโอ เบื้องต้น"
    },
    "education-section": {
      "text-title": "Education",
      "text-date-swu": "June 2010 - March 2014",
      "text-title-swu": "มหาวิทยาลัยศรีนครินทรวิโรฒ, ประเทศไทย",
      "text-description-swu": "วิทยาศาสตรบัณฑิต (GPAX 3.32)",
      "text-date-dpu": "June 2018 - August 2018",
      "text-title-dpu": "มหาวิทยาลัยธุรกิจบัณฑิตย์, ประเทศไทย",
      "text-description-dpu": "โครงการ Programmer Bootcamp #1 โดย บริษัท Hatari Wireless และภาควิชาวิศวกรรมคอมพิวเตอร์ มหาวิทยาลัยธุรกิจบัณฑิตย์"
    },
    "contact-section": {
      "text-title": "Contact",
      "text-sentence": "ผมมีความยินดีกับทุกโอกาสที่เสนอเข้ามา หากต้องการติดต่อผม สามารถแจ้งเข้ามาได้เลย ขอบคุณครับ",
      "text-name": "Full Name",
      "input-name-error": "ตัวอักษรภาษาไทยและตัวอักษรภาษาอังกฤษเท่านั้น",
      "input-name-error2": "โปรดกรอกข้อมูล full name ให้ครบถ้วน",
      "text-email": "Email",
      "input-email-error": "รูปแบบอีเมล์ไม่ถูกต้อง",
      "input-email-error2": "โปรดกรอกข้อมูล email ให้ครบถ้วน",
      "text-subject": "Subject",
      "input-subject-error": "โปรดกรอกข้อมูล subject ให้ครบถ้วน",
      "text-message": "Message",
      "input-message-error": "โปรดกรอกข้อมูล message ให้ครบถ้วน",
      "text-sql-injection-error": "มีการใช้ script ไม่สามารถดำเนินการต่อได้",
      "text-send-data-success": "ส่งข้อมูลสำเร็จ",
      "text-send-data-fail": "ส่งข้อมูลไม่สำเร็จเพราะ: ",
      "text-phone": "Phone",
      "text-btn-send": "SEND"
    }
  }
}